#include <stdio.h>

int Q[] = { 5000, 2000, 1000, 500, 200, 100, 50, 20, 10 }; //создание одномерного массива, в который входят все имеющиеся купюры

int main()
{
    int n, q, x; //q - вспомогательная переменная в цикле
    printf("Введите сумму: ");
    scanf("%d",&n);
    x=0; //количество купюр,  ему по умолчанию присваивается 0
    for(int i = 0; i <= 8; ++i) //цикл перебирает все элементы массива, от большего к меньшему. 8 - количество номиналов купюр
    {
        q = Q[i];
        x += n / q; //считаем, сколько раз входит купюра в сумму
        n %= q;  //сумме присваивается остаток от деления на данную купюру
    }
    if(n > 0) x = -1; //проверяем наличие остатка, который банкомат не сможет выдать
    printf("Количество купюр: %d",x);
    return 0;
}
